//===================================================
//
// アイテムクラスヘッダー	[item.cpp]
// Author : Konishi Yuuto
//
//===================================================

//===================================================
// インクルード
//===================================================
#include "board.h"
#include "manager.h"
#include "renderer.h"

//===================================================
// static初期化処理
//===================================================
LPDIRECT3DTEXTURE9 CBoard::m_apTexture[MAX_BOARD_TEXTURE] = {};

//===================================================
// ポリゴン生成
//===================================================
CBoard * CBoard::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// 初期化処理
	CBoard *pItem = new CBoard;
	pItem->Init(pos, size);

	// テクスチャの設定
	pItem->BindTexture(m_apTexture[0]);

	return pItem;
}

//=============================================================================
// テクスチャロード
//=============================================================================
HRESULT CBoard::Load(void)
{
	// レンダラーの情報を受け取る
	CRenderer *pRenderer = NULL;
	pRenderer = CManager::GetRenderer();
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	// テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice, "data/Texture/board000.png",
		&m_apTexture[0]);

	return S_OK;
}

//=============================================================================
// テクスチャアンロード
//=============================================================================
void CBoard::UnLoad(void)
{
	for (int nCount = 0; nCount < MAX_BOARD_TEXTURE; nCount++)
	{
		// テクスチャの開放
		if (m_apTexture[nCount] != NULL)
		{
			m_apTexture[nCount]->Release();
			m_apTexture[nCount] = NULL;
		}
	}
}

//===================================================
// コンストラクタ
//===================================================
CBoard::CBoard()
{
	m_Pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);			// 位置情報
	m_Dir = D3DXVECTOR3(0.0f, 0.0f, 0.0f);			// 方向7
}

//===================================================
// デストラクタ
//===================================================
CBoard::~CBoard()
{

}

//===================================================
// 初期化処理
//===================================================
HRESULT CBoard::Init(const D3DXVECTOR3 pos, const D3DXVECTOR3 size)
{
	// 初期化処理
	CBillboard::Init(pos, size);

	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CBoard::Uninit(void)
{
	CBillboard::Uninit();
}

//===================================================
// 更新処理
//===================================================
void CBoard::Update(void)
{

}

//===================================================
// 描画処理
//===================================================
void CBoard::Draw(void)
{
	CBillboard::Draw();
}